# 怎么从pandas中选择多行或者多列？

In [1]:
import pandas as pd

In [4]:
ufo = pd.read_csv('https://raw.githubusercontent.com/intohole/pandas-videos/master/data/ufo.csv')

In [5]:
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

#### 使用loc函数，对行列进行操作
##### loc[行,列]
#### loc[0:2,:] -> 取0~2行数据，并取出所有列
#### 取出多列时 loc[0:3,[columnName1,columnName2,...]]
#### 按照范围取出列时 loc[0:3,columnName1:columnNameN]]

In [6]:
ufo.loc[0,:]

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

In [7]:
ufo.loc[0:3,:]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [9]:
ufo.loc[0:3,'City']

0         Ithaca
1    Willingboro
2        Holyoke
3        Abilene
Name: City, dtype: object

In [10]:
ufo.loc[0:2,['City','State']]

          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO

In [12]:
ufo.loc[ufo.State == 'NJ'].head()

            City Colors Reported Shape Reported State              Time
1    Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
141       Newark             NaN         SPHERE    NJ   7/15/1950 21:30
147   Sandy Hook             NaN       TRIANGLE    NJ  10/15/1950 15:00
255    Keansburg             NaN         CIRCLE    NJ   11/15/1953 3:00
311     Red Bank          ORANGE         CIRCLE    NJ  12/15/1954 23:10

In [14]:
ufo.loc[ufo.State == 'NJ','City'].head()

1      Willingboro
141         Newark
147     Sandy Hook
255      Keansburg
311       Red Bank
Name: City, dtype: object